---
type: PlanTopology
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# PlanTopology

`Autodesk.Revit.DB.PlanTopology` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetRoomIds | 2013 | `public ICollection < ElementId > GetRoomIds ()` |
| Property | Circuits | — | `public PlanCircuitSet Circuits { get ; }` |
| Property | Level | — | `public Level Level { get ; }` |
| Property | Phase | — | `public Phase Phase { get ; }` |